app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "content", "article_id") VALUES (?, ?, ?)  [["author", "Isabelle"], ["content", "Blop"], ["article_id", 1]]
---
  def create
	comment = Comment.new author:params[:author], content:params[:content], article_id:params[:id]
	comment.save